import streamlit as st
def main():

    st.title("หุ่นเเบบนี้ควรเเต่งตัวยังไงดี")

    # สร้างส่วนเลือกหุ่น
    st.sidebar.header('เลือกหุ่นของคุณ')
    selected_body_type = st.sidebar.radio('เลือกรูปร่างของคุณ', ['เเอปเปิ้ล', 'ลูกเเพร์', 'นาฬิกาทราย','สามเหลี่ยมคว่ำ','ทรงตรง'])

    # รายละเอียดของแต่ละประเภทหุ่น
    body_types_details = {
        'เเอปเปิ้ล': 'หุ่นทรงเเอปเปิ้ล มีลักษณะดังนี้ ไหล่กว้าง รอบอกเเละสะโพกใหญ่ รอบเอวหนา ทำให้เห็นส่วนเว้าคอดเอวไม่ชัดเจน ตั้งเเต้ก้นลงมาถึงช่วงขา เล็ก บาง เมื่อเทียบกับสัดส่วนอื่นๆ',
        'ลูกเเพร์': 'หุ่นทรงลูกเเพร์ มีลักษณะดังนี้ ช่วงบนจะเล็ก สะโพกเเละต้นขาจะกว้าง รวมถึงรูปร่างมีความโค้งมนคล้ายกับลักษณะลูกเเพร์',
        'นาฬิกาทราย': 'หุ่นทรงนาฬิกาทราย มีลักษณะดังนี้ ช่วงไหล่เเละสะโพกห่างกันไม่มาก ตามสัดส่วนจะมีเอวที่เล็กคอด ถือว่าเป็นรูปร่างในฝันของสาวๆ',
        'สามเหลี่ยมคว่ำ': 'หุ่นรูปสามเหลี่ยมคว่ำ มีลักษณะดังนี้ ช่วงแขน ไหล่ ที่ใหญ่และกว้างกว่าช่วงสะโพกซึ่งมีความแคบหรือบาง เอวมีความโค้งเว้าเล็กน้อย',
        'ทรงตรง': 'หุ่นทรงตรงมีลักษณะดังนี้ ไม่มีเอว หรือผอมแต่ไม่มีเอว มีลักษณะทรวดทรงสี่เหลี่ยมผืนผ้า คล้ายกับหุ่นของผู้ชาย ตั้งแต่ช่วงหัวไหล่ หน้าอก เอว และสะโพกจะมีความกว้างหรือระนาบเดียวกัน ไม่มีส่วนเว้าส่วนโค้งที่ช่วงเอว',
    }

    # แสดงรายละเอียดของหุ่นที่เลือก
    st.write(f"## หุ่นทรง: {selected_body_type}")
    st.write(body_types_details[selected_body_type])


    # ปุ่มสำหรับการแสดงเคล็ดลับการแต่งตัว
    if st.button("เเต่งตัวยังไงดี"):
        styling_tips = get_styling_tips(selected_body_type)
        st.success(styling_tips)

def get_styling_tips(selected_body_type):
    if selected_body_type == 'เเอปเปิ้ล':
        return """เคล็ดลับการแต่งตัวสำหรับคนที่มีรูปร่างแบบแอปเปิ้ล:
- เลือกสวมใส่เสื้อผ้าที่พอดีกับตัวและไม่รัดแน่นจนเกินไป
- หลีกเลี่ยงเสื้อผ้าที่รัดที่เอวหรือสะโพก
- เลือกสวมใส่เสื้อผ้าที่มีสีเข้มหรือลายพิมพ์เล็กๆ ที่บริเวณหน้าท้อง
- สวมใส่เสื้อคอวี เสื้อคลุมยาว เสื้อเอวสูง และกางเกงทรงตรง
- โชว์เรียวขาสวยๆ ด้วยการสวมใส่กระโปรงหรือกางเกงขาสั้น
- คุณยังสามารถเล่นกับเครื่องประดับ เช่น สร้อยคอและต่างหู สิ่งที่สำคัญที่สุดคือการดึงดูดความสนใจไปที่ใบหน้าหรือที่ขาหากคุณมีขาที่สวยงาม
- เสื้อผ้าที่ดีที่สุดสำหรับรูปร่างแบบแอปเปิ้ลคือเสื้อทรงเอ สวมใส่ชุดเดรสลายพิมพ์หรือแจ็คเก็ตที่มีลวดลายเพื่อเพิ่มเลเยอร์และเบี่ยงเบนความสนใจ ลุคแบบโมโนโครม, สีเข้ม, ชุดเดรสแขนยาว เสื้อท่อนบนพลิ้วไหวจะช่วยได้ คุณยังสามารถใส่กางเกงทรงบาน
 เสื้อผ้าที่ควรเลี่ยง:
  - หลีกเลี่ยงการสวมใส่ชุดเดรสหรือเสื้อรัดรูปกับกางเก็งยีนส์ทรงสกินนี่ เพราะจะทำให้หน้าท้องดูเด่นชัดขึ้น
  - ควรใช้เข็มขัดคาดเอวสูงแทนเข็มขัดปกติเพื่อสร้างความสมดุล"""
    
    elif selected_body_type == 'ลูกเเพร์':
        return """เคล็ดลับการแต่งตัวสำหรับคนที่มีรูปร่างแบบลูกเเพร์:
- เลือกใส่เสื้อผ้าที่พอดีกับสะโพกและต้นขา และหลีกเลี่ยงกางเกงที่รัดแนนเกินไปหรือหลวมเกินไป
- สวมใส่กางเกงทรงกระบอก กางเกงทรงบาน กางเกงทรงเอ หรือกางเกงทรงพาลาซโซ
- สวมใส่เสื้อผ้าที่เน้นส่วนบนของร่างกาย เช่น เสื้อคอวี เสื้อที่มีดีเทลที่ไหล่
- ใช้เข็มขัดคาดเอวเพื่อเน้นเอว
- หลีกเลี่ยงการใส่เสื้อผ้าที่พองใหญ่มากเกินไปบริเวณหน้าอก เนื่องจากจะทำให้ช่วงบนของร่างกายดูใหญ่ขึ้น
- สวมใส่รองเท้าส้นสูงเพื่อช่วยยืดขากให้ดูยาวขึ้น
 เสื้อผ้าที่ควรเลี่ยง:
 - ควรหลีกเลี่ยงการสวมใส่เสื้อรัดรูป คอวี และกางเกงทรงหลวม
        """
        
    elif selected_body_type == 'นาฬิกาทราย':
        return """เคล็ดลับการแต่งตัวสำหรับคนที่มีรูปร่างแบบนาฬิกาทราย:
- เลือกสวมใส่เสื้อผ้าที่พอดีกับตัวและเน้นเอวของคุณ
- สวมใส่ชุดเดรสทรงเอ หรือชุดเดรสทรงเพรียว
- ใช้เข็มขัดคาดเอวเพื่อเน้นเอวของคุณ
- สวมใส่กระโปรงทรงพลีท หรือกระโปรงทรงสอบเพื่อโชว์เรียวขาสวยๆ
- หลีกเลี่ยงการสวมใส่เสื้อผ้าที่รัดแน่นเกินไปหรือหลวมเกินไป
 เสื้อผ้าที่ควรเลี่ยง:
การใส่เสื้อหรือกางเกงทรงหลวมๆ อาจทำให้รูปร่างดูกลมตันและไม่สมส่วน
        """
        
    elif selected_body_type == 'สามเหลี่ยมคว่ำ':
        return """เคล็ดลับการแต่งตัวสำหรับคนที่มีรูปร่างแบบสามเหลี่ยมคว่ำ:
- เลือกใส่เสื้อผ้าที่เน้นช่วงสะโพกและขา เช่น กางเกงทรงเอ กระโปรงทรงเอ หรือกระโปรงทรงสอบ
- หลีกเลี่ยงการสวมใส่เสื้อผ้าที่มีดีเทลเยอะๆ บริเวณไหล่ เช่น เสื้อที่มีโบว์หรือระบายที่ไหล่
- ใส่เข็มขัดคาดเอวเพื่อเน้นเอวและทำให้รูปร่างดูมีสัดส่วนมากขึ้น
- สวมใส่เสื้อผ้าที่มีลวดลายหรือสีสันที่สะโพกและขาเพื่อดึงดูดความสนใจไปที่ส่วนเหล่านั้น
ตัวอย่างชุดที่เหมาะสำหรับรูปร่างแบบสามเหลี่ยมคว่ำ:
- กางเกงทรงเอ + เสื้อกล้าม
- กระโปรงทรงเอ + เสื้อคอวี
- ชุดเดรสทรงเอ
- กางเกงขายาวทรงขากระบอก + เสื้อเบลเซอร์
- กระโปรงทรงสอบ + เสื้อคอปาด
        """
    elif selected_body_type == 'ทรงตรง':
        return """เคล็ดลับการแต่งตัวสำหรับคนที่มีรูปร่างแบบทรงตรง:
- เลือกสวมใส่เสื้อผ้าที่ช่วยเพิ่มความเมนหรือความสูงให้กับรูปร่าง เช่น กางเกงทรงเอ, กางเกงทรงบาน, กระโปรงทรงลอน
- สวมใส่เสื้อผ้าที่มีเนื้อผ้าเป็นชั้นๆ เพื่อเพิ่มเลเยอร์และสร้างมิติให้กับรูปร่าง
- การใช้สายเสื้อผ้าและแบบลายพิมพ์ที่ยาวและหนา ช่วยเสริมความสูง
- หลีกเลี่ยงการสวมใส่เสื้อผ้าที่เน้นเอวหรือสะโพกมากเกินไป เพราะอาจทำให้รูปร่างดูไม่สมส่วน
- การสวมใส่รองเท้าส้นสูงสามารถเพิ่มความสูงและความเรียบร้อยให้กับรูปร่าง
 เสื้อผ้าที่ควรเลี่ยง:
 - ควรหลีกเลี่ยงการสวมใส่เสื้อผ้าที่มีดีเทลที่เอวหรือสะโพกมากเกินไป เช่น เข็มขัด ชาเล่อ ราบ
 - การสวมใส่เสื้อผ้าที่มีสีสันหรือลวดลายที่เต็มไปด้วยเนื้อผ้าสามารถช่วยให้รูปร่างดูเรียบร้อยและยาวขึ้นได้
        """
    
    else:
        return "ไม่พบเคล็ดลับการแต่งตัวสำหรับรูปร่างนี้"
        
if __name__ == "__main__":
    main()
